Fix #81: Move all diagrams to mermaid  (#93)
