--- a/End-to-End-Tests.md
+++ b/End-to-End-Tests.md
@@ -51,23 +51,19 @@ At Oppia, we highly regard the end user, so we have end-to-end (E2E) tests to te
 
 Unfortunately, E2E tests are much less deterministic than our other tests. The tests operate on a web browser that accesses a local Oppia server, so the non-determinism of web browsers makes the tests less deterministic as well. For example, suppose that you write a test that clicks a button to open a modal and then clicks a button inside the modal to close it. Sometimes, the modal will open before the test tries to click the close button, so the test will pass. Other times, the test will try to click before the modal has opened, and the test will fail. We can see this schematically:
 
-```text
-               <---A--->
+```mermaid
+flowchart LR
+a("<--A-->")
 
-                        +-------+
-                        | Modal |
-+----------+   +---//---+ opens +-----------+
-| Click to |   |        +-------+           |
-| open     +---+                            +---->
-| modal    |   |        +-------------+     |
-+----------+   +---//---+ Click to    +-----+
-                        | close modal |
-                        +-------------+
+A("Click to open modal") ----|"//"| B("Modal opens")
+A ---- |"//"| C("Click to close modal")
+B ---- P("+")
+C ---- P
+P --> Q("other operations")
 
-               <---B--->
+b("<--B-->")
 
-
---------------------- time ---------------------->
+starts ---- time -----> ends
 ```
 
 The durations of steps `A` and `B` are non-deterministic because `A` depends on how quickly the browser executes the frontend code to open the modal, and `B` depends on how fast the test code runs. Since these operations are happening on separate processes, the operating system makes no guarantees about which will complete first. In other words, we have a race condition.
